l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc407x_8x_clk.c
/*
 * Copyright (C) 2013 by Ole Reinhardt (ole.reinhardt@embedded-it.de)
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holders nor the names of
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
 * THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * For additional information see http://www.ethernut.de/
 */

/**************************************************************************/
/* The follwing copyright notice applies to the clock initialisation code */
/************************************************************************
*
* $Id: system_LPC407x_8x.c 59014 2012-11-01 15:09:57Z anderslu $    
*      system_LPC407x_8x.c      2012-01-16
*//**
* @file    system_LPC407x_8x.c
* @file    system_LPC407x_8x.c
* @brief  CMSIS Cortex-M3, M4 Device Peripheral Access Layer Source File
*            for the NXP LPC407x_8x_177x_8x Device Series
*
*      ARM Limited (ARM) is supplying this software for use with
*      Cortex-M processor based microcontrollers.  This file can be
*      freely distributed within development tools that are supporting
*      such ARM based processors.
*
* @version  1.0
* @date    30. May. 2012
* @author  NXP MCU SW Application Team
*
* Copyright(C) 2012, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
**********************************************************************/


/*
 * \verbatim
 * $Id: $
 * \endverbatim
 */

#include <stdint.h>

#include <cfg/arch.h>
#include <arch/cm3.h>
#include <arch/cm3/timer.h>
#include <arch/cm3/nxp/lpc407x_8x_clk.h>
#include <cfg/clock.h>

#include <arch/cm3/nxp/lpc407x_8x.h>

#define __CLK_DIV(x,y) (((y) == 0) ? 0: (x)/(y))

/*
//-------- <<< Use Configuration Wizard in Context Menu >>> ------------------
*/
/*--------------------- Clock Configuration ----------------------------------
//
//  <e>  Clock Configuration
//    <h>  System Controls and Status Register (SCS - address 0x400F C1A0)
//      <o1.0>  EMC Shift Control Bit
//          <i>    Controls how addresses are output on the EMC address pins for static memories
//          <0=>  Static CS addresses match bus width; AD[1] = 0 for 32 bit, AD[0] = 0 for 16+32 bit (Bit 0 is 0)
//          <1=>  Static CS addresses start at LSB 0 regardless of memory width (Bit 0 is 1)
//
//      <o1.1>  EMC Reset Disable Bit
//          <i>    If 0 (zero), all registers and functions of the EMC are initialized upon any reset condition
//          <i>    If 1, EMC is still retained its state through a warm reset
//          <0=>  Both EMC resets are asserted when any type of chip reset event occurs (Bit 1 is 0)
//          <1=>  Portions of EMC will only be reset by POR or BOR event (Bit 1 is 1)
//
//      <o1.2>  EMC Burst Control
//          <i>    Set to 1 to prevent multiple sequential accesses to memory via EMC static memory chip selects
//          <0=>  Burst enabled (Bit 2 is 0)
//          <1=>  Bust disbled (Bit 2 is 1)
//
//      <o1.3>  MCIPWR Active Level
//          <i>    Selects the active level for the SD card interface signal SD_PWR
//          <0=>  SD_PWR is active low (inverted output of the SD Card interface block) (Bit 3 is 0)
//          <1=>  SD_PWR is active high (follows the output of the SD Card interface block) (Bit 3 is 1)
//
//      <o1.4>  Main Oscillator Range Select
//          <0=>  In Range 1 MHz to 20 MHz (Bit 4 is 0)
//          <1=>  In Range 15 MHz to 25 MHz (Bit 4 is 1)
//
//      <o1.5>  Main Oscillator enable
//          <i>    0 (zero) means disabled, 1 means enable
//
//      <o1.6>  Main Oscillator status (Read-Only)
//    </h>
//
//    <h>  Clock Source Select Register (CLKSRCSEL - address 0x400F C10C)
//      <o2.0>  CLKSRC: Select the clock source for sysclk to PLL0 clock
//          <0=>  Internal RC oscillator (Bit 0 is 0)
//          <1=>  Main oscillator (Bit 0 is 1)
//    </h>
//
//    <e3>PLL0 Configuration (Main PLL PLL0CFG - address 0x400F C084)
//      <i>      F_in  is in the range of 1 MHz to 25 MHz
//      <i>      F_cco = (F_in * M * 2 * P) is in range of 156 MHz to 320 MHz
//      <i>      PLL out clock = (F_cco / (2 * P)) is in rane of 9.75 MHz to 160 MHz
//
//      <o4.0..4>   MSEL: PLL Multiplier Value
//            <i>        M Value
//            <1-32><#-1>
//
//      <o4.5..6>  PSEL: PLL Divider Value
//            <i>        P Value
//            <0=>       1
//            <1=>      2
//            <2=>      4
//            <3=>      8
//    </e>
//
//    <e5>PLL1 Configuration (Alt PLL PLL1CFG - address 0x400F C0A4)
//      <i>      F_in  is in the range of 1 MHz to 25 MHz
//      <i>      F_cco = (F_in * M * 2 * P) is in range of 156 MHz to 320 MHz
//      <i>      PLL out clock = (F_cco / (2 * P)) is in rane of 9.75 MHz to 160 MHz
//
//      <o6.0..4>   MSEL: PLL Multiplier Value
//            <i>        M Value
//            <1-32><#-1>
//
//      <o6.5..6>  PSEL: PLL Divider Value
//            <i>    P Value
//            <0=>  1
//            <1=>  2
//            <2=>  4
//            <3=>  8
//    </e>
//
//    <h>  CPU Clock Selection Register (CCLKSEL - address 0x400F C104)
//      <o7.0..4>  CCLKDIV: Select the value for divider of CPU clock (CCLK)
//            <i>    0: The divider is turned off. No clock will be provided to the CPU
//            <i>    n: The input clock is divided by n to produce the CPU clock
//            <0-31>
//
//      <o7.8>    CCLKSEL: Select the input to the divider of CPU clock
//            <0=>  sysclk clock is used
//            <1=>  Main PLL0 clock is used
//    </h>
//
//    <h>  USB Clock Selection Register (USBCLKSEL - 0x400F C108)
//      <o8.0..4>  USBDIV: USB clock (source PLL0) divider selection
//            <0=>  Divider is off and no clock provides to USB subsystem
//            <4=>  Divider value is 4 (The source clock is divided by 4)
//            <6=>  Divider value is 6 (The source clock is divided by 6)
//
//      <o8.8..9>  USBSEL: Select the source for USB clock divider
//            <i>    When CPU clock is selected, the USB can be accessed
//            <i>    by software but cannot perform USB functions
//            <0=>  sysclk clock (the clock input to PLL0)
//            <1=>  The clock output from PLL0
//            <2=>  The clock output from PLL1
//    </h>
//
//    <h>  EMC Clock Selection Register (EMCCLKSEL - address 0x400F C100)
//      <o9.0>  EMCDIV: Set the divider for EMC clock
//          <0=> Divider value is 1
//          <1=> Divider value is 2 (EMC clock is equal a half of input clock)
//    </h>
//
//    <h>  Peripheral Clock Selection Register (PCLKSEL - address 0x400F C1A8)
//      <o10.0..4>  PCLKDIV: APB Peripheral clock divider
//            <i>  0: The divider is turned off. No clock will be provided to APB peripherals
//            <i>  n: The input clock is divided by n to produce the APB peripheral clock
//            <0-31>
//    </h>
//
//    <h>  SPIFI Clock Selection Register (SPIFICLKSEL - address 0x400F C1B4)
//      <o11.0..4>  SPIFIDIV: Set the divider for SPIFI clock
//            <i>  0: The divider is turned off. No clock will be provided to the SPIFI
//            <i>  n: The input clock is divided by n to produce the SPIFI clock
//            <0-31>
//
//      <o11.8..9>  SPIFISEL: Select the input clock for SPIFI clock divider
//            <0=>  sysclk clock (the clock input to PLL0)
//            <1=>  The clock output from PLL0
//            <2=>  The clock output from PLL1
//    </h>
//
//    <h>  Power Control for Peripherals Register (PCONP - address 0x400F C1C8)
//      <o12.0>   PCLCD: LCD controller power/clock enable (bit 0)
//      <o12.1>   PCTIM0: Timer/Counter 0 power/clock enable (bit 1)
//      <o12.2>   PCTIM1: Timer/Counter 1 power/clock enable (bit 2)
//      <o12.3>   PCUART0: UART 0 power/clock enable (bit 3)
//      <o12.4>   PCUART1: UART 1 power/clock enable (bit 4)
//      <o12.5>   PCPWM0: PWM0 power/clock enable (bit 5)
//      <o12.6>   PCPWM1: PWM1 power/clock enable (bit 6)
//      <o12.7>   PCI2C0: I2C 0 interface power/clock enable (bit 7)
//      <o12.8>   PCUART4: UART 4 power/clock enable (bit 8)
//      <o12.9>   PCRTC: RTC and Event Recorder power/clock enable (bit 9)
//      <o12.10>  PCSSP1: SSP 1 interface power/clock enable (bit 10)
//      <o12.11>  PCEMC: External Memory Controller power/clock enable (bit 11)
//      <o12.12>  PCADC: A/D converter power/clock enable (bit 12)
//      <o12.13>  PCCAN1: CAN controller 1 power/clock enable (bit 13)
//      <o12.14>  PCCAN2: CAN controller 2 power/clock enable (bit 14)
//      <o12.15>  PCGPIO: IOCON, GPIO, and GPIO interrupts power/clock enable (bit 15)
//      <o12.17>  PCMCPWM: Motor Control PWM power/clock enable (bit 17)
//      <o12.18>  PCQEI: Quadrature encoder interface power/clock enable (bit 18)
//      <o12.19>  PCI2C1: I2C 1 interface power/clock enable (bit 19)
//      <o12.20>  PCSSP2: SSP 2 interface power/clock enable (bit 20)
//      <o12.21>  PCSSP0: SSP 0 interface power/clock enable (bit 21)
//      <o12.22>  PCTIM2: Timer 2 power/clock enable (bit 22)
//      <o12.23>  PCTIM3: Timer 3 power/clock enable (bit 23)
//      <o12.24>  PCUART2: UART 2 power/clock enable (bit 24)
//      <o12.25>  PCUART3: UART 3 power/clock enable (bit 25)
//      <o12.26>  PCI2C2: I2C 2 interface power/clock enable (bit 26)
//      <o12.27>  PCI2S: I2S interface power/clock enable (bit 27)
//      <o12.28>  PCSDC: SD Card interface power/clock enable (bit 28)
//      <o12.29>  PCGPDMA: GPDMA function power/clock enable (bit 29)
//      <o12.30>  PCENET: Ethernet block power/clock enable (bit 30)
//      <o12.31>  PCUSB: USB interface power/clock enable (bit 31)
//    </h>
//
//    <h>  Clock Output Configuration Register (CLKOUTCFG)
//      <o13.0..3>  CLKOUTSEL: Clock Source for CLKOUT Selection
//            <0=>  CPU clock
//            <1=>  Main Oscillator
//            <2=>  Internal RC Oscillator
//            <3=>  USB clock
//            <4=>  RTC Oscillator
//            <5=>  unused
//            <6=>  Watchdog Oscillator
//
//      <o13.4..7>  CLKOUTDIV: Output Clock Divider
//            <1-16><#-1>
//
//      <o13.8>    CLKOUT_EN: CLKOUT enable
//    </h>
//
//  </e>
*/
#define CLOCK_SETUP           1
#define SCS_Val               0x00000020
#define CLKSRCSEL_Val         0x00000001
#define PLL0_SETUP            1
#define PLL0CFG_Val           0x00000007
#define PLL1_SETUP            1
#define PLL1CFG_Val           0x0000000C
#define CCLKSEL_Val           0x00000101
#define USBCLKSEL_Val         0x00000102
#define EMCCLKSEL_Val         0x00000000
#define PCLKSEL_Val           0x00000002
#define SPIFICLKSEL_Val       0x00000202
#define PCONP_Val             0x042887DE
#define CLKOUTCFG_Val         0x00000100

#define LPC_CPACR             0xE000ED88

#define SCB_MVFR0             0xE000EF40
#define SCB_MVFR0_RESET       0x10110021

#define SCB_MVFR1             0xE000EF44
#define SCB_MVFR1_RESET       0x11000011


