l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc407x_8x_clk.c
/*--------------------- Flash Accelerator Configuration ----------------------
//
//  <e>  Flash Accelerator Configuration register (FLASHCFG - address 0x400F C000)
//    <o1.12..15>  FLASHTIM: Flash Access Time
//          <0=>  1 CPU clock (for CPU clock up to 20 MHz)
//          <1=>  2 CPU clocks (for CPU clock up to 40 MHz)
//          <2=>  3 CPU clocks (for CPU clock up to 60 MHz)
//          <3=>  4 CPU clocks (for CPU clock up to 80 MHz)
//          <4=>  5 CPU clocks (for CPU clock up to 100 MHz)
//          <5=>  6 CPU clocks (for any CPU clock)
//  </e>
*/
#define FLASH_SETUP           1
#define FLASHCFG_Val          0x00005000

/*----------------------------------------------------------------------------
  Check the register settings
 *----------------------------------------------------------------------------*/
#define CHECK_RANGE(val, min, max)                ((val < min) || (val > max))
#define CHECK_RSVD(val, mask)                     (val & mask)

/* Clock Configuration -------------------------------------------------------*/
#if (CHECK_RSVD((SCS_Val),       ~0x0000003F))
   #error "SCS: Invalid values of reserved bits!"
#endif

#if (CHECK_RANGE((CLKSRCSEL_Val), 0, 1))
   #error "CLKSRCSEL: Value out of range!"
#endif

#if (CHECK_RSVD((PLL0CFG_Val),   ~0x0000007F))
   #error "PLL0CFG: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((PLL1CFG_Val),   ~0x0000007F))
   #error "PLL1CFG: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((CCLKSEL_Val),   ~0x0000011F))
   #error "CCLKSEL: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((USBCLKSEL_Val), ~0x0000031F))
   #error "USBCLKSEL: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((EMCCLKSEL_Val), ~0x00000001))
   #error "EMCCLKSEL: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((PCLKSEL_Val), ~0x0000001F))
   #error "PCLKSEL: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((PCONP_Val), ~0xFFFEFFFF))
   #error "PCONP: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((CLKOUTCFG_Val), ~0x000001FF))
   #error "CLKOUTCFG: Invalid values of reserved bits!"
#endif

/* Flash Accelerator Configuration -------------------------------------------*/
#if (CHECK_RSVD((FLASHCFG_Val), ~0x0000F000))
   #warning "FLASHCFG: Invalid values of reserved bits!"
#endif


/*----------------------------------------------------------------------------
  DEFINES
 *----------------------------------------------------------------------------*/
/* pll_out_clk = F_cco / (2 × P)
   F_cco = pll_in_clk × M × 2 × P */
#define __M(__PLLCFG_Val)     ((__PLLCFG_Val & 0x1F) + 1)
#define __PLL0_CLK(__F_IN)    (__F_IN * __M(PLL0CFG_Val))
#define __PLL1_CLK            (OSC_CLK * __M(PLL1CFG_Val))
#define __CCLK_DIV            (CCLKSEL_Val & 0x1F)
#define __PCLK_DIV            (PCLKSEL_Val & 0x1F)
#define __ECLK_DIV            ((EMCCLKSEL_Val & 0x01) + 1)
#define __SPIFI_DIV           (SPIFICLKSEL_Val & 0x1F)

/* Determine core clock frequency according to settings */
#if (CLOCK_SETUP)                       /* Clock Setup                        */

  #if ((CLKSRCSEL_Val & 0x01) == 1) && ((SCS_Val & 0x20)== 0)
   #error "Main Oscillator is selected as clock source but is not enabled!"
  #endif

  #if ((CCLKSEL_Val & 0x100) == 0x100) && (PLL0_SETUP == 0)
   #error "Main PLL is selected as clock source but is not enabled!"
  #endif

  #if ((CCLKSEL_Val & 0x100) == 0)      /* cclk = sysclk */
    #if ((CLKSRCSEL_Val & 0x01) == 0)   /* sysclk = irc_clk */
      #define __CORE_CLK (IRC_OSC / __CCLK_DIV)
      #define __PER_CLK  (IRC_OSC/  __PCLK_DIV)
      #define __EMC_CLK  (__CORE_CLK/  __ECLK_DIV)
    #else                               /* sysclk = osc_clk */
      #define __CORE_CLK (OSC_CLK / __CCLK_DIV)
      #define __PER_CLK  (OSC_CLK/  __PCLK_DIV)
      #define __EMC_CLK  (__CORE_CLK/  __ECLK_DIV)
    #endif
  #else                                 /* cclk = pll_clk */
    #if ((CLKSRCSEL_Val & 0x01) == 0)   /* sysclk = irc_clk */
      #define __CORE_CLK (__PLL0_CLK(IRC_OSC) / __CCLK_DIV)
      #define __PER_CLK  (__PLL0_CLK(IRC_OSC) / __PCLK_DIV)
      #define __EMC_CLK  (__CORE_CLK / __ECLK_DIV)
    #else                               /* sysclk = osc_clk */
      #define __CORE_CLK (__PLL0_CLK(OSC_CLK) / __CCLK_DIV)
      #define __PER_CLK  (__PLL0_CLK(OSC_CLK) / __PCLK_DIV)
      #define __EMC_CLK  (__CORE_CLK / __ECLK_DIV)
    #endif
  #endif
  #if ((SPIFICLKSEL_Val & 0x300) == 0)
    #if ((CLKSRCSEL_Val & 0x01) == 0)   /* sysclk = irc_clk */
      #define __SPIFI_CLK (IRC_OSC / __SPIFI_DIV)
    #else                               /* sysclk = osc_clk */
      #define __SPIFI_CLK (OSC_CLK / __SPIFI_DIV)      
    #endif
  #elif ((SPIFICLKSEL_Val & 0x300) == 1)
    #if ((CLKSRCSEL_Val & 0x01) == 0)   /* sysclk = irc_clk */
      #define __CORE_CLK (__PLL0_CLK(IRC_OSC) / __SPIFI_DIV)
    #else                               /* sysclk = osc_clk */
      #define __CORE_CLK (__PLL0_CLK(OSC_CLK) / __SPIFI_DIV)
    #endif
  #else
    #define __SPIFI_CLK (__PLL1_CLK / __SPIFI_DIV)
  #endif
#else
        #define __CORE_CLK  (IRC_OSC)
        #define __PER_CLK   (IRC_OSC)
        #define __EMC_CLK   (__CORE_CLK)
        #define __SPIFI_CLK (0)
#endif

/*----------------------------------------------------------------------------
  Clock Variable definitions
 *----------------------------------------------------------------------------*/
uint32_t SystemCoreClock = __CORE_CLK;   /*!< System Clock Frequency (Core Clock)*/
uint32_t PeripheralClock = __PER_CLK;    /*!< Peripheral Clock Frequency (Pclk)  */
uint32_t EMCClock        = __EMC_CLK;    /*!< EMC Clock Frequency                */
uint32_t USBClock        = (48000000UL); /*!< USB Clock Frequency                */
uint32_t SPIFIClock      = __SPIFI_CLK;  /*!< SPIFI Clock Frequecy               */


/*----------------------------------------------------------------------------
  Clock functions
 *----------------------------------------------------------------------------*/
void SystemCoreClockUpdate (void)            /* Get Core Clock Frequency      */
{
  /* Determine clock frequency according to clock register values             */
  if ((LPC_SC->CCLKSEL &0x100) == 0) {            /* cclk = sysclk    */
    if ((LPC_SC->CLKSRCSEL & 0x01) == 0) {    /* sysclk = irc_clk */
      SystemCoreClock = __CLK_DIV(IRC_OSC , (LPC_SC->CCLKSEL & 0x1F));
          PeripheralClock = __CLK_DIV(IRC_OSC , (LPC_SC->PCLKSEL & 0x1F));
          EMCClock        = (SystemCoreClock / ((LPC_SC->EMCCLKSEL & 0x01)+1));
    }
    else {                                        /* sysclk = osc_clk */
      if ((LPC_SC->SCS & 0x40) == 0) {
          SystemCoreClock = 0;                      /* this should never happen! */
          PeripheralClock = 0;
          EMCClock        = 0;
      }
      else {
          SystemCoreClock = __CLK_DIV(OSC_CLK , (LPC_SC->CCLKSEL & 0x1F));
          PeripheralClock = __CLK_DIV(OSC_CLK , (LPC_SC->PCLKSEL & 0x1F));
          EMCClock        = (SystemCoreClock / ((LPC_SC->EMCCLKSEL & 0x01)+1));
      }
    }
  }
  else {                                          /* cclk = pll_clk */
    if ((LPC_SC->PLL0STAT & 0x100) == 0) {        /* PLL0 not enabled */
          SystemCoreClock = 0;                      /* this should never happen! */
          PeripheralClock = 0;
          EMCClock       = 0;
    }
    else {
      if ((LPC_SC->CLKSRCSEL & 0x01) == 0) {    /* sysclk = irc_clk */
          uint8_t mul = ((LPC_SC->PLL0STAT & 0x1F) + 1);
          uint8_t cpu_div = (LPC_SC->CCLKSEL & 0x1F);
          uint8_t per_div = (LPC_SC->PCLKSEL & 0x1F);
          uint8_t emc_div = (LPC_SC->EMCCLKSEL & 0x01)+1;
          SystemCoreClock = __CLK_DIV(IRC_OSC * mul , cpu_div);
          PeripheralClock = __CLK_DIV(IRC_OSC * mul , per_div);
          EMCClock        = SystemCoreClock / emc_div;
      }
      else {                                        /* sysclk = osc_clk */
        if ((LPC_SC->SCS & 0x40) == 0) {
          SystemCoreClock = 0;                      /* this should never happen! */
          PeripheralClock = 0;
          EMCClock       = 0;
        }
        else {
          uint8_t mul = ((LPC_SC->PLL0STAT & 0x1F) + 1);
          uint8_t cpu_div = (LPC_SC->CCLKSEL & 0x1F);
          uint8_t per_div = (LPC_SC->PCLKSEL & 0x1F);
      uint8_t emc_div = (LPC_SC->EMCCLKSEL & 0x01)+1;
          SystemCoreClock = __CLK_DIV(OSC_CLK * mul , cpu_div);
          PeripheralClock = __CLK_DIV(OSC_CLK * mul , per_div);
          EMCClock        = SystemCoreClock / emc_div;
        }
      }
    }
  }
  /* ---update USBClock------------------*/
  if(LPC_SC->USBCLKSEL & (0x01<<8))//Use PLL0 as the input to the USB clock divider
  {
    switch (LPC_SC->USBCLKSEL & 0x1F)
    {
    case 0:
      USBClock = 0; //no clock will be provided to the USB subsystem
      break;
    case 2:
    case 4:
    case 6:
            {
                 uint8_t mul = ((LPC_SC->PLL0STAT & 0x1F) + 1);
                 uint8_t usb_div = (LPC_SC->USBCLKSEL & 0x1F);
      if(LPC_SC->CLKSRCSEL & 0x01)  //pll_clk_in = main_osc
        USBClock = OSC_CLK * mul / usb_div;
      else //pll_clk_in = irc_clk
        USBClock = IRC_OSC * mul / usb_div;
            }
            break;
    default:
      USBClock = 0;  /* this should never happen! */
    }
  }
  else if(LPC_SC->USBCLKSEL & (0x02<<8))//usb_input_clk = alt_pll (pll1)
  {
    USBClock = (OSC_CLK * ((LPC_SC->PLL1STAT & 0x1F) + 1));
  }
  else
    USBClock = 0; /* this should never happen! */
    
  /* ---update SPIFIClock------------------*/
  switch((LPC_SC->SPIFICLKSEL & 0x300)>>8)
  {
  case 0: /*spifi_clk = sysclk*/
    if ((LPC_SC->CLKSRCSEL & 0x01) == 0) {    /* sysclk = irc_clk */
      SPIFIClock = __CLK_DIV(IRC_OSC , (LPC_SC->SPIFICLKSEL & 0x1F));
    }
    else {                                        /* sysclk = osc_clk */
      if ((LPC_SC->SCS & 0x40) == 0) {
          SPIFIClock = 0;                         /* */
      }
      else {
          SPIFIClock = __CLK_DIV(OSC_CLK , (LPC_SC->SPIFICLKSEL & 0x1F));
      }
    }
    break;
  case 1: /*spifi_clk = pll0*/
    if ((LPC_SC->PLL0STAT & 0x100) == 0) {        /* PLL0 not enabled */
          SPIFIClock = 0;                    /* this should never happen! */
    }
    else {
      if ((LPC_SC->CLKSRCSEL & 0x01) == 0) {    /* sysclk = irc_clk */
          uint8_t mul = ((LPC_SC->PLL0STAT & 0x1F) + 1);
          uint8_t spifi_div = (LPC_SC->SPIFICLKSEL & 0x1F);
          SPIFIClock = __CLK_DIV(IRC_OSC * mul , spifi_div);
      }
      else {                                        /* sysclk = osc_clk */
        if ((LPC_SC->SCS & 0x40) == 0) {
          SPIFIClock = 0;                           /* */
        }
        else {
          uint8_t mul = ((LPC_SC->PLL0STAT & 0x1F) + 1);
          uint8_t spifi_div = (LPC_SC->SPIFICLKSEL & 0x1F);
          SPIFIClock = __CLK_DIV(OSC_CLK * mul , spifi_div);
        }
      }
    }
    break;
  case 2: /*spifi_clk = pll1*/
    if ((LPC_SC->PLL1STAT & 0x100) == 0) {        /* PLL1 not enabled */
          SPIFIClock = 0;                         /* this should never happen! */
    }
    else {
      if ((LPC_SC->SCS & 0x40) == 0) {
        SPIFIClock = 0;                           /* */
      }
      else {
        uint8_t mul = ((LPC_SC->PLL1STAT & 0x1F) + 1);
        uint8_t spifi_div = (LPC_SC->SPIFICLKSEL & 0x1F);
        SPIFIClock = __CLK_DIV(OSC_CLK * mul , spifi_div);
      }
    }
    break;
  default:
      SPIFIClock = 0; /* this should never happen! */
    break;
  }
}

/**
  * @brief  Sets System clock frequency to the configured defaults.
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
int SetSysClock(void)
{
    int rc = 0;

#if (CLOCK_SETUP)                       /* Clock Setup                        */
  LPC_SC->SCS       = SCS_Val;
  if (SCS_Val & (1 << 5)) {             /* If Main Oscillator is enabled      */
    while ((LPC_SC->SCS & (1<<6)) == 0);/* Wait for Oscillator to be ready    */
  }

  LPC_SC->CLKSRCSEL = CLKSRCSEL_Val;    /* Select Clock Source for sysclk/PLL0*/

#if (PLL0_SETUP)
  LPC_SC->PLL0CFG   = PLL0CFG_Val;
  LPC_SC->PLL0CON   = 0x01;             /* PLL0 Enable                        */
  LPC_SC->PLL0FEED  = 0xAA;
  LPC_SC->PLL0FEED  = 0x55;
  while (!(LPC_SC->PLL0STAT & (1<<10)));/* Wait for PLOCK0                    */
#endif

